app/views/valera_actions/_index.html.erb

<% ValeraAction.all.each do |valera_action| %>
---
SELECT "valera_actions".* FROM "valera_actions"