app/views/valera_actions/_list.html.erb

SELECT "valera_actions".* FROM "valera_actions"
SELECT "conditions".* FROM "conditions" WHERE "conditions"."valera_action_id" = $1  [["valera_action_id", 1]]
---
  <%= link_to 'Add action', new_valera_action_path, class: "categorieOptions" if user_signed_in?() %>
  <% ValeraAction.all.each do |valera_action| %>
    <% valera_action.conditions.each do |cond| %>