app/controllers/conditions_controller.rb

    def show
      @valera_action = ValeraAction.find(params[:valera_action_id])
      @condition = @valera_action.conditions.find(params[:id])
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "conditions".* FROM "conditions" WHERE "conditions"."valera_action_id" = $1 AND "conditions"."id" = $2 LIMIT $3  [["valera_action_id", 1], ["id", 2], ["LIMIT", 1]]

    def new
      @valera_action = ValeraAction.find(params[:valera_action_id])
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
      @valera_action = ValeraAction.find(params[:valera_action_id])
      @condition = @valera_action.conditions.find(params[:id])
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "conditions".* FROM "conditions" WHERE "conditions"."valera_action_id" = $1 AND "conditions"."id" = $2 LIMIT $3  [["valera_action_id", 1], ["id", 2], ["LIMIT", 1]]

    def create
      @valera_action = ValeraAction.find(params[:valera_action_id])
      @condition = @valera_action.conditions.create(condition_params)
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "conditions" ("attr_name", "min", "max", "attr_name_eff", "value_eff", "valera_action_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
      @valera_action = ValeraAction.find(params[:valera_action_id])
      @condition = @valera_action.conditions.find(params[:id])


      @condition.update(condition_params)
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "conditions".* FROM "conditions" WHERE "conditions"."valera_action_id" = $1 AND "conditions"."id" = $2 LIMIT $3  [["valera_action_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "conditions" SET "attr_name_eff" = $1, "updated_at" = $2 WHERE "conditions"."id" = $3  [["attr_name_eff", "none"], ["updated_at", "2022-01-21 06:17:17.316378"], ["id", 4]]

    def destroy
      @valera_action = ValeraAction.find(params[:valera_action_id])
      @condition = @valera_action.conditions.find(params[:id])
      @condition.destroy
---
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "conditions".* FROM "conditions" WHERE "conditions"."valera_action_id" = $1 AND "conditions"."id" = $2 LIMIT $3  [["valera_action_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "conditions" WHERE "conditions"."id" = $1  [["id", 3]]