app/controllers/states_controller.rb

    def index
        @user = User.find(params[:user_id])
        @state = @user.state.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "states".* FROM "states" WHERE "states"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

    def create
        @state = State.find(params[:user_id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]