app/controllers/stats_records_controller.rb

  def index
    @stats_records = StatsRecord.all
---
SELECT "stats_records".* FROM "stats_records"