app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    if user_signed_in?
      @user = User.find(params[:id])

INSERT INTO "users" ("email", "name", "password_digest", "health", "alcohol", "happy", "tired", "money", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
UPDATE "users" SET "health" = $1, "alcohol" = $2, "happy" = $3, "tired" = $4, "money" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["health", 100], ["alcohol", 0], ["happy", 0], ["tired", 0], ["money", 300], ["updated_at", "2022-01-21 15:37:07.979408"], ["id", 1]]
---
  def user_save
    if @user.save

SELECT "conditions".* FROM "conditions" WHERE "conditions"."valera_action_id" = $1  [["valera_action_id", 2]]
SELECT "valera_actions".* FROM "valera_actions" WHERE "valera_actions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "health" = $1, "alcohol" = $2, "happy" = $3, "tired" = $4, "money" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["health", -180], ["alcohol", -510], ["happy", -91], ["tired", 1470], ["money", 2160], ["updated_at", "2022-01-21 06:25:44.455905"], ["id", 1]]
---
  def user_update
    action_effect = params[:user].permit!
    if action_effect['action_id'] == 'New game'
      new_stat
      user_save
      return
    end

    conds = ValeraAction.find(action_effect['action_id']).conditions
    if action_available?(conds)
      select_effects!(conds, action_effect)
      updated_stat = stats_update(action_effect)
      validate_stats!(updated_stat)
      @user.update(updated_stat)

SELECT "stats_records".* FROM "stats_records" WHERE "stats_records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "stats_records" ("name", "money", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "admin"], ["money", 400], ["user_id", 1], ["created_at", "2022-01-21 13:53:45.391920"], ["updated_at", "2022-01-21 13:53:45.391920"]]
UPDATE "stats_records" SET "money" = $1, "updated_at" = $2 WHERE "stats_records"."id" = $3  [["money", 500], ["updated_at", "2022-01-21 21:50:54.672194"], ["id", 1]]
---
  def save_max_stat
    if @stats_record = StatsRecord.exists?(@user.id)
      @stats_record = StatsRecord.find(@user.id)
      @stats_record.money = [@stats_record.money, @user.money].max
    else
      @stats_record = StatsRecord.create(id: @user.id, name: @user.name, money: @user.money)
    end
    @stats_record.save!